<!-- terraform-plan-vercel -->
## ❌ Terraform plan (vercel) — Plan failed
**Changes:** +0 ~1 -0
**Time:**
| TZ | Time |
| --- | --- |
| UTC | 2026-03-13, 3:56:05 a.m. |
| NZ | 2026-03-13, 4:56:05 p.m. |
| PT | 2026-03-12, 8:56:05 p.m. |
| ET | 2026-03-12, 11:56:05 p.m. |

Run: https://github.com/JesusFilm/forge/actions/runs/23035459861

```
data.aws_ssm_parameter.strapi_preview_secret_prod: Reading...
data.aws_ssm_parameter.next_public_cms_hostname_stage: Reading...
data.aws_ssm_parameter.api_token: Reading...
data.aws_ssm_parameter.next_public_graphql_url_stage: Reading...
data.aws_ssm_parameter.strapi_api_token_stage: Reading...
data.aws_ssm_parameter.next_public_cms_hostname_prod: Reading...
data.aws_ssm_parameter.strapi_preview_secret_stage: Reading...
data.aws_ssm_parameter.next_public_graphql_url_prod: Reading...
data.aws_ssm_parameter.strapi_api_token_prod: Reading...
data.aws_ssm_parameter.api_token: Read complete after 0s [id=/forge/vercel/api_token]
vercel_project.web: Refreshing state... [id=prj_bkpwmtIJtBAvAvDXVIS5G9fWLQh4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # vercel_project.web will be updated in-place
  ~ resource "vercel_project" "web" {
      ~ build_machine_type                                = "turbo" -> (known after apply)
      + enable_preview_feedback                           = (known after apply)
      + git_provider_options                              = (known after apply)
        id                                                = "prj_bkpwmtIJtBAvAvDXVIS5G9fWLQh4"
        name                                              = "forge-web"
      + preview_comments                                  = (known after apply)
      + protection_bypass_for_automation_secret           = (sensitive value)
      ~ resource_config                                   = {
          ~ fluid                     = true -> (known after apply)
          + function_default_cpu_type = (known after apply)
          ~ function_default_regions  = [
              - "iad1",
            ] -> (known after apply)
          + function_default_timeout  = (known after apply)
        } -> (known after apply)
      + root_directory                                    = "apps/web"
      ~ serverless_function_region                        = "iad1" -> (known after apply)
      + team_id                                           = (known after apply)
        # (16 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Error: reading SSM Parameter (/forge/aws/web/stage/STRAPI_API_TOKEN): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 18485b3f-460b-46c8-8ab4-fbe200206b7b, api error AccessDeniedException: User: arn:aws:sts::031374266475:assumed-role/forge-github-actions-terraform-vercel-plan/GitHubActions is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/stage/STRAPI_API_TOKEN because no identity-based policy allows the ssm:GetParameter action

  with data.aws_ssm_parameter.strapi_api_token_stage,
  on data.tf line 8, in data "aws_ssm_parameter" "strapi_api_token_stage":
   8: data "aws_ssm_parameter" "strapi_api_token_stage" {


Error: reading SSM Parameter (/forge/aws/web/prod/STRAPI_API_TOKEN): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: c2947ec2-bf11-4bdd-ad51-39a6da886190, api error AccessDeniedException: User: arn:aws:sts::031374266475:assumed-role/forge-github-actions-terraform-vercel-plan/GitHubActions is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/prod/STRAPI_API_TOKEN because no identity-based policy allows the ssm:GetParameter action

  with data.aws_ssm_parameter.strapi_api_token_prod,
  on data.tf line 13, in data "aws_ssm_parameter" "strapi_api_token_prod":
  13: data "aws_ssm_parameter" "strapi_api_token_prod" {


Error: reading SSM Parameter (/forge/aws/web/stage/STRAPI_PREVIEW_SECRET): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 6484c102-a918-44a7-b916-f461d9e9e140, api error AccessDeniedException: User: arn:aws:sts::031374266475:assumed-role/forge-github-actions-terraform-vercel-plan/GitHubActions is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/stage/STRAPI_PREVIEW_SECRET because no identity-based policy allows the ssm:GetParameter action

  with data.aws_ssm_parameter.strapi_preview_secret_stage,
  on data.tf line 18, in data "aws_ssm_parameter" "strapi_preview_secret_stage":
  18: data "aws_ssm_parameter" "strapi_preview_secret_stage" {


Error: reading SSM Parameter (/forge/aws/web/prod/STRAPI_PREVIEW_SECRET): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 9543275f-e9bf-46de-b3c2-1dd5125e6b27, api error AccessDeniedException: User: arn:aws:sts::031374266475:assumed-role/forge-github-actions-terraform-vercel-plan/GitHubActions is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/prod/STRAPI_PREVIEW_SECRET because no identity-based policy allows the ssm:GetParameter action

  with data.aws_ssm_parameter.strapi_preview_secret_prod,
  on data.tf line 23, in data "aws_ssm_parameter" "strapi_preview_secret_prod":
  23: data "aws_ssm_parameter" "strapi_preview_secret_prod" {


Error: reading SSM Parameter (/forge/aws/web/stage/NEXT_PUBLIC_GRAPHQL_URL): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: beb7ac64-5cc5-49c0-ba7d-5a33600568a7, api error AccessDeniedException: User: arn:aws:sts::031374266475:assumed-role/forge-github-actions-terraform-vercel-plan/GitHubActions is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/stage/NEXT_PUBLIC_GRAPHQL_URL because no identity-based policy allows the ssm:GetParameter action

  with data.aws_ssm_parameter.next_public_graphql_url_stage,
  on data.tf line 28, in data "aws_ssm_parameter" "next_public_graphql_url_stage":
  28: data "aws_ssm_parameter" "next_public_graphql_url_stage" {


Error: reading SSM Parameter (/forge/aws/web/prod/NEXT_PUBLIC_GRAPHQL_URL): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 836dadfa-d191-4c02-8b83-a29786554b83, api error AccessDeniedException: User: arn:aws:sts::031374266475:assumed-role/forge-github-actions-terraform-vercel-plan/GitHubActions is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/prod/NEXT_PUBLIC_GRAPHQL_URL because no identity-based policy allows the ssm:GetParameter action

  with data.aws_ssm_parameter.next_public_graphql_url_prod,
  on data.tf line 32, in data "aws_ssm_parameter" "next_public_graphql_url_prod":
  32: data "aws_ssm_parameter" "next_public_graphql_url_prod" {


Error: reading SSM Parameter (/forge/aws/web/stage/NEXT_PUBLIC_CMS_HOSTNAME): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 3ff4249b-9eb8-4f2a-8fa1-be5a0ced7c77, api error AccessDeniedException: User: arn:aws:sts::031374266475:assumed-role/forge-github-actions-terraform-vercel-plan/GitHubActions is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/stage/NEXT_PUBLIC_CMS_HOSTNAME because no identity-based policy allows the ssm:GetParameter action

  with data.aws_ssm_parameter.next_public_cms_hostname_stage,
  on data.tf line 36, in data "aws_ssm_parameter" "next_public_cms_hostname_stage":
  36: data "aws_ssm_parameter" "next_public_cms_hostname_stage" {


Error: reading SSM Parameter (/forge/aws/web/prod/NEXT_PUBLIC_CMS_HOSTNAME): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 671e5ef2-a210-4f8c-af5c-3064c11a9303, api error AccessDeniedException: User: arn:aws:sts::031374266475:assumed-role/forge-github-actions-terraform-vercel-plan/GitHubActions is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/prod/NEXT_PUBLIC_CMS_HOSTNAME because no identity-based policy allows the ssm:GetParameter action

  with data.aws_ssm_parameter.next_public_cms_hostname_prod,
  on data.tf line 40, in data "aws_ssm_parameter" "next_public_cms_hostname_prod":
  40: data "aws_ssm_parameter" "next_public_cms_hostname_prod" {

::error::Terraform exited with code 1.

```